open-sf/osf/os/net/mac/osf/nrf52840-osf.c
/*
 * Copyright (c) 2022, Technology Innovation Institute
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
 * OF THE POSSIBILITY OF SUCH DAMAGE.
 */

 /**
 * \file
 *         OSF nRF52840 driver (originally forked from the Blueflood
 *         nrf-radio-driver.c).
 * \author
 *         Michael Baddeley <michael.baddeley@tii.ae>
 *         Yevgen Gyl <yevgen.gyl@unikie.com>
 *         Beshr Al Nahas <beshr@chalmers.se>
 */

#include <inttypes.h>

#include "contiki.h"
#include "contiki-net.h"
#include "node-id.h"
#include "dev/leds.h"
#include "watchdog.h"

#include "nrf_radio.h"
#include "nrf_ppi.h"
#include "nrf_timer.h"
#include "nrf_clock.h"
#include "net/mac/osf/nrf52840-osf.h"

#include "net/mac/osf/osf.h"
#include "net/mac/osf/osf-packet.h"
#include "net/mac/osf/osf-timer.h"
#include "net/mac/osf/osf-ch.h"
#include "net/mac/osf/osf-debug.h"
#include "net/mac/osf/osf-stat.h"

/* Log configuration */
#include "sys/log.h"
#define LOG_MODULE "NRF52840-OSF"
#define LOG_LEVEL LOG_LEVEL_NONE

#define UNUSED(x) (void)(x)

osf_phy_conf_t *osf_phy_conf;

/*---------------------------------------------------------------------------*/
static void print_radio_config();

/*---------------------------------------------------------------------------*/
static uint32_t swap_bits(uint32_t inp)
{
  uint32_t i;
  uint32_t retval = 0;

  inp = (inp & 0x000000FFUL);

  for (i = 0; i < 8; i++) {
    retval |= ((inp >> i) & 0x01) << (7 - i);
  }

  return retval;
}

/*---------------------------------------------------------------------------*/
static uint32_t bytewise_bitswap(uint32_t inp)
{
  return (swap_bits(inp >> 24) << 24) | (swap_bits(inp >> 16) << 16)
      | (swap_bits(inp >> 8) << 8) | (swap_bits(inp));
}


/*---------------------------------------------------------------------------*/
static nrf_radio_packet_conf_t nrf_phy_conf_2M = {
  0, // lflen
  0, // s0len (bytes)
  0, // s1len (bits)
#if defined(RADIO_PCNF0_S1INCL_Msk)
  RADIO_PCNF0_S1INCL_Automatic, // s1incl
#endif
#if defined(RADIO_PCNF0_CILEN_Msk)
  0, // cilen
#endif
#if defined(RADIO_PCNF0_PLEN_Msk)
  RADIO_PCNF0_PLEN_16bit,       // plen
#endif
#if defined(RADIO_PCNF0_CRCINC_Msk)
  RADIO_PCNF0_CRCINC_Exclude,   // crcincl
#endif
#if defined(RADIO_PCNF0_TERMLEN_Msk)
  0, // termlen
#endif
  255, // maxlen
  255, // statlen
  2, // balen
  RADIO_PCNF1_ENDIAN_Big,       // big_endian
  OSF_PHY_WHITENING             // whiten
};

osf_phy_conf_t osf_phy_conf_2M = {
  "osf_phy_conf_2M",
  RADIO_MODE_MODE_Ble_2Mbit,
  &nrf_phy_conf_2M,
  RADIO_CRCCNF_LEN_Two, RADIO_CRCCNF_SKIPADDR_Skip, 0x11021UL, 0xFFFFUL,
  US_TO_RTIMERTICKSX(20),       // header_air_ticks - 2B PREAMBLE + 2B BA + 1B PREFIX (5*8/2)
  0,                            // post_addr_air_ticks
  0,                            // payload_air_ticks
  US_TO_RTIMERTICKSX(8),        // footer_air_ticks - 2B CRC
  92,                           // tx_rx_addr_offset_ticks - 5.746us measured on LA, average over 10 rounds)
  85,                           // tx_rx_end_offset_ticks - 5.284us (measured on LA)
  0,                            // packet_air_ticks
  0                             // slot_duration
};

/*---------------------------------------------------------------------------*/
static nrf_radio_packet_conf_t nrf_phy_conf_1M = {
  0, // lflen
  0, // s0len (bytes)
  0, // s1len (bits)
#if defined(RADIO_PCNF0_S1INCL_Msk)
  RADIO_PCNF0_S1INCL_Automatic, // s1incl
#endif
#if defined(RADIO_PCNF0_CILEN_Msk)
  0, // cilen
#endif
#if defined(RADIO_PCNF0_PLEN_Msk)
  RADIO_PCNF0_PLEN_8bit,        // plen
#endif
#if defined(RADIO_PCNF0_CRCINC_Msk)
  RADIO_PCNF0_CRCINC_Exclude,   // crcincl
#endif
#if defined(RADIO_PCNF0_TERMLEN_Msk)
  0, // termlen
#endif
  255, // maxlen
  255, // statlen
  2, // balen
  RADIO_PCNF1_ENDIAN_Big,       // big_endian
  OSF_PHY_WHITENING             // whitee
};

osf_phy_conf_t osf_phy_conf_1M = {
  "osf_phy_conf_1M",
  RADIO_MODE_MODE_Ble_1Mbit,
  &nrf_phy_conf_1M,
  RADIO_CRCCNF_LEN_Two, RADIO_CRCCNF_SKIPADDR_Skip,  0x11021UL, 0xFFFFUL,
  US_TO_RTIMERTICKSX(32),       // header_air_ticks - 1B PREAMBLE + 2B BA + 1B PREFIX (4*8)
  0,                            // post_addr_air_ticks
  0,                            // payload_air_ticks
  US_TO_RTIMERTICKSX(16),       // footer_air_ticks - 2B CRC
  174,                          // tx_rx_addr_offset_ticks - 10.856us (measured on LA, average over 10 rounds)
  158,                          // tx_rx_end_offset_ticks - 9.9us (measured on LA)
  0,                            // packet_air_ticks
  0                             // slot_duration
};

#if NRF52840_WITH_CODED_PHY
/*---------------------------------------------------------------------------*/
// NB: STATLEN only works for 500 when S0=1 or LF=8. This shouldn't be the case.
//     IF STATLEN is set, then it doesn't appear to read LF. If STATLEN is
//     not set and LF=8, then it will use the 1st byte in RAM as the length
//     field..
// NB: https://www.edn.com/bluetooth-5-variations-complicate-phy-testing/
static nrf_radio_packet_conf_t nrf_phy_conf_500K = {
  0, // lflen
  0, // s0len (bytes)
  0, // s1len (bits)
#if defined(RADIO_PCNF0_S1INCL_Msk)
  RADIO_PCNF0_S1INCL_Automatic, // s1incl
#endif
#if defined(RADIO_PCNF0_CILEN_Msk)
  2, // cilen
#endif
#if defined(RADIO_PCNF0_PLEN_Msk)
  RADIO_PCNF0_PLEN_LongRange,   // plen
#endif
#if defined(RADIO_PCNF0_CRCINC_Msk)
  RADIO_PCNF0_CRCINC_Exclude,   // crcincl
#endif
#if defined(RADIO_PCNF0_TERMLEN_Msk)
  3, // termlen
#endif
  255, // maxlen
  255, // statlen
  3, // balen
  RADIO_PCNF1_ENDIAN_Big,       // big_endian
  OSF_PHY_WHITENING             // whiten
};

osf_phy_conf_t osf_phy_conf_500K = {
  "osf_phy_conf_500K",
  RADIO_MODE_MODE_Ble_LR500Kbit,
  &nrf_phy_conf_500K,
  RADIO_CRCCNF_LEN_Three, RADIO_CRCCNF_SKIPADDR_Skip, 0x0100065B, 0x555555UL,
  // US_TO_RTIMERTICKSX(336),       // header_air_ticks - 10B PRE @1M + 3B BA and 1B PREFIX @125K (80us + 256us)
  US_TO_RTIMERTICKSX(324) + 2,  // header_air_ticks - MEASURED 324.128us ON LA (READY to ADDR). Why? Only Nordic knows.
  // US_TO_RTIMERTICKSX(104),       // post_addr_air_ticks - 2bit CI and 3bit TERM1 + 1B S0 @125K (16us + 24us + 64us).
  // US_TO_RTIMERTICKSX(67),       // post_addr_air_ticks - 67us on LA. Should be 104us. Why? Only Nordic knows. -3us coming from somewhere.
  0,                            // post_addr_air_ticks - Calculated in my_radio_set_phy_airtime();
  0,                            // payload_air_ticks
  // US_TO_RTIMERTICKSX(54),       // footer_air_ticks - 3B CRC + 3bit TERM2 @500K (48us + 6us)
  US_TO_RTIMERTICKSX(57),       // footer_air_ticks - 57us on LA. Should be 54us. Why? Only Nordic knows. +3us coming from somewhere.
  1188,                         // tx_rx_addr_offset_ticks - 74.263us (measured on LA, average over 10 rounds)
  396,                          // tx_rx_end_offset_ticks - 24.74us (measured on LA)
  0,                            // packet_air_ticks
  0                             // slot_duration
};

