open-sf/osf/os/net/mac/osf/nrf52840-osf.c
/*---------------------------------------------------------------------------*/
static nrf_radio_packet_conf_t nrf_phy_conf_125K = {
  0, // lflen
  0, // s0len (bytes)
  0, // s1len (bits)
#if defined(RADIO_PCNF0_S1INCL_Msk)
  RADIO_PCNF0_S1INCL_Automatic, // s1incl
#endif
#if defined(RADIO_PCNF0_CILEN_Msk)
  2, // cilen
#endif
#if defined(RADIO_PCNF0_PLEN_Msk)
  RADIO_PCNF0_PLEN_LongRange,   // plen
#endif
#if defined(RADIO_PCNF0_CRCINC_Msk)
  RADIO_PCNF0_CRCINC_Exclude,   // crcincl
#endif
#if defined(RADIO_PCNF0_TERMLEN_Msk)
  3, // termlen
#endif
  255, // maxlen
  255, // statlen
  3, // balen
  RADIO_PCNF1_ENDIAN_Big,       // big_endian
  OSF_PHY_WHITENING             // whiten
};

osf_phy_conf_t osf_phy_conf_125K = {
  "osf_phy_conf_125K",
  RADIO_MODE_MODE_Ble_LR125Kbit,
  &nrf_phy_conf_125K,
  RADIO_CRCCNF_LEN_Three, RADIO_CRCCNF_SKIPADDR_Skip, 0x0100065B, 0x555555UL,
  // US_TO_RTIMERTICKSX(336),      // header_air_ticks - 10B PRE @1M + 3B BA and 1B PREFIX @125K (80us + 256us)
  US_TO_RTIMERTICKSX(324) + 2,  // header_air_ticks - MEASURED 324.128us ON LA (READY to ADDR). Why? Only Nordic knows.
  // US_TO_RTIMERTICKSX(40),       // post_addr_air_ticks - 2bit CI and 3bit TERM1 @125K (16us + 24 us)
  // US_TO_RTIMERTICKSX(48),       // post_addr_air_ticks - 48us on LA. Should be 40us. Why? Only Nordic knows. A single bit must be coming from somewhere.
  0,                            // post_addr_air_ticks - Calculated in my_radio_set_phy_airtime();
  0,                            // payload_air_ticks
  US_TO_RTIMERTICKSX(216),      // footer_air_ticks - 3B CRC (192) + 3bit TERM2 (24)
  1187,                         // tx_rx_addr_offset_ticks - 74.217us (measured on LA, average over 10 rounds)
  566,                          // tx_rx_end_offset_ticks - 35.416us (measured on LA)
  0,                            // packet_air_ticks
  0                             // slot_duration
};
#endif

#if NRF52840_WITH_IEEE_PHY
/*---------------------------------------------------------------------------*/
static nrf_radio_packet_conf_t nrf_phy_conf_802154 = {
  0, // lflen
  0, // s0len (bytes)
  0, // s1len (bits)
#if defined(RADIO_PCNF0_S1INCL_Msk)
  RADIO_PCNF0_S1INCL_Automatic, // s1incl
#endif
#if defined(RADIO_PCNF0_CILEN_Msk)
  0, // cilen
#endif
#if defined(RADIO_PCNF0_PLEN_Msk)
  RADIO_PCNF0_PLEN_32bitZero,   // plen
#endif
#if defined(RADIO_PCNF0_CRCINC_Msk)
  RADIO_PCNF0_CRCINC_Exclude,   // crcincl
#endif
#if defined(RADIO_PCNF0_TERMLEN_Msk)
  0, // termlen
#endif
  127, // maxlen
  127, // statlen
  0, // balen
  RADIO_PCNF1_ENDIAN_Little,    // big_endian
  RADIO_PCNF1_WHITEEN_Disabled  // whiten
};

osf_phy_conf_t osf_phy_conf_802154 = {
  "osf_phy_conf_802154",
  RADIO_MODE_MODE_Ieee802154_250Kbit,
  &nrf_phy_conf_802154,
  RADIO_CRCCNF_LEN_Two, RADIO_CRCCNF_SKIPADDR_Ieee802154, 0x11021, 0x0UL,
  US_TO_RTIMERTICKSX(140),      // header_air_ticks - 4B PRE + 1B SFD  @250K (128us +32 us)
  // 2241,                         // header_air_ticks - MEASURED 140.064us on LA (READY to ADDR). Why? Only Nordic knows.
  0,                            // post_addr_air_ticks -  Calculated in my_radio_set_phy_airtime();
  0,                            // payload_air_ticks
  US_TO_RTIMERTICKSX(64),       // footer_air_ticks - 2B CRC @256K
  692,                          // tx_rx_addr_offset_ticks - 43.242us (measured on LA, average over 10 rounds)
  626,                          // tx_rx_end_offset_ticks - 39.156us (measured on LA)
  0,                            // packet_air_ticks
  0                             // slot_duration
};
#endif

/*---------------------------------------------------------------------------*/

static uint8_t nrf_tx_power = OSF_TXPOWER;

/*---------------------------------------------------------------------------*/
void
set_txpower(uint8_t p)
{
  nrf_tx_power = p;
}

/*---------------------------------------------------------------------------*/
static void
configure_errata(osf_phy_conf_t *conf) {
  /*
   * Workarounds should be applied only when switching to/from LE Coded PHY
   * so no need to apply them every time.
   *
   * nRF52840 Rev 2, build codes CKAA-Dx0, QIAA-Dx0
   * [153] RADIO: RSSI parameter adjustment
   * RSSI changes over temperature.
   * Temperature ≤ +10°C or > +30°C.
   * Add the following compensation to the RSSI sample value based on temperature measurement
   * (the onchip TEMP peripheral can be used to measure temperature):
     • For TEMP ≤ -30°C, RSSISAMPLE = RSSISAMPLE +3
     • For TEMP > -30°C and TEMP ≤ -10°C, RSSISAMPLE = RSSISAMPLE +2
     • For TEMP > -10°C and TEMP ≤ +10°C, RSSISAMPLE = RSSISAMPLE +1
     • For TEMP > +10°C and TEMP ≤ +30°C, RSSISAMPLE = RSSISAMPLE + 0
     • For TEMP > +30°C and TEMP ≤ +50°C, RSSISAMPLE = RSSISAMPLE - 1
     • For TEMP > +50°C and TEMP ≤ +70°C, RSSISAMPLE = RSSISAMPLE - 2
     • For TEMP > +70°C, RSSISAMPLE = RSSISAMPLE - 3
   *
   * nRF52840 Engineering A Errata v1.2
   * [164] RADIO: Low sensitivity in long range mode
   *
   * RF52840 Rev 2, build codes CKAA-Dx0, QIAA-Dx0
   * [172] RADIO: BLE long range co-channel performance
   *
   * nRF52840 Rev 1 Errata
   * nRF52840 Rev 2, build codes CKAA-Dx0, QIAA-Dx0
   * [191] RADIO: High packet error rate in BLE Long Range mode
   * BLE long range (Ble_LR125Kbit or Ble_LR500Kbit).
   * Blocker signal present at the same or nearby RF frequency.
   * Fails BLE test with co-channel interference (RF-PHY/RCV/BV-29-C) without FW workaround.
   * Workaround is incorporated into S140 SoftDevice v6.1.1 and the DTM example in SDK v15.3.0. See the
   * following document for a description of the workarounds:
   * nRF52840 Errata Attachment Anomaly 172 Addendum
   * https://infocenter.nordicsemi.com/pdf/nRF52_PAN_172_add_v1.0.pdf
   *
   * nRF52840 Rev 2, build codes CKAA-Dx0, QIAA-Dx0
   * [204] RADIO: Switching between TX and RX causes unwanted emissions
   * Always use DISABLE when switching from TX to RX.
   *
   * nRF52840 Rev 2, build codes CKAA-Dx0, QIAA-Dx0
   * [245] RADIO: CRC is wrong when data whitening is
   * enabled and address field is included in CRC calculation
   * In RX, if data whitening is enabled and the CRC checker is configured to take
   * the address field into CRC calculations.
   * CRC failures are reported though received packet contents are good.
   *
   * This configuration applies to IC Rev. Revision 3, build codes QFAA-Fx0, QIAA-Fx0, CKAA-Fx0.
   * [254] RADIO: External PAs, FEMs, and LNAs need additional Radio configuration
   */
  switch (conf->mode) {
    case PHY_BLE_1M:
    case PHY_BLE_2M:
      /* [164] */
      // *(volatile uint32_t *)0x4000173C &= ~0x80000000;
      /* [191] */
      *(volatile uint32_t *)0x40001740 = ((*((volatile uint32_t *)0x40001740)) & 0x7FFFFFFFUL);
      break;
#if NRF52840_WITH_CODED_PHY
    case PHY_BLE_500K:
    case PHY_BLE_125K:
      /* [164] */
      // *(volatile uint32_t *)0x4000173C |= 0x80000000;
      // *(volatile uint32_t *)0x4000173C = ((*(volatile uint32_t *)0x4000173C & 0xFFFFFF00) | 0x5C);
      /* [191] */
      *(volatile uint32_t *)0x40001740 = ((*((volatile uint32_t *)0x40001740)) & 0x7FFF00FF) |  0x80000000 | (((uint32_t)(196)) << 8);
      break;
#endif
#if NRF52840_WITH_IEEE_PHY
    case PHY_IEEE:
      /* [191] */
      *(volatile uint32_t *)0x40001740 = ((*((volatile uint32_t *)0x40001740)) & 0x7FFFFFFF);
      break;
#endif      
    default:
      break;
  }
}

