open-sf/osf/os/net/mac/osf/nrf52840-osf.c
/*---------------------------------------------------------------------------*/
static void
configure_phy(osf_phy_conf_t *phy, uint8_t len, uint8_t statlen)
{
  NRF_RADIO->MODE = phy->mode;
  /* Configure nrf phy conf */
  switch(phy->mode) {
    case PHY_BLE_2M:
    case PHY_BLE_1M:
      NRF_RADIO->SHORTS |= RADIO_SHORTS_END_DISABLE_Msk;
      break;
#if NRF52840_WITH_CODED_PHY
    case PHY_BLE_500K:
    case PHY_BLE_125K:
#endif
#if NRF52840_WITH_IEEE_PHY
    case PHY_IEEE:
#endif
#if (NRF52840_WITH_IEEE_PHY || NRF52840_WITH_CODED_PHY)
      NRF_RADIO->SHORTS |= RADIO_SHORTS_PHYEND_DISABLE_Msk;
      /* For BLE LR and IEEE only center frequency is valid */
      NRF_RADIO->MODECNF0 |= (RADIO_MODECNF0_DTX_Center << RADIO_MODECNF0_DTX_Pos);
      break;
#endif
    default:
      LOG_ERR("Unknown PHY configuration (%u)!\n", phy->mode);
      break;
  }
  /* Set phy conf fields */
  phy->conf->lflen = (!statlen) ? 8 : 0;
  phy->conf->s0len = (!statlen || phy->mode == PHY_BLE_500K) ? 1 : 0;
  phy->conf->s1len = (!statlen && OSF_PACKET_WITH_S1) ? 1 : 0;
  phy->conf->statlen = (!statlen) ? 0 : len;
  phy->conf->maxlen = (!statlen) ? OSF_MAXLEN(phy->mode) : len;
#if defined(RADIO_PCNF0_CRCINC_Msk)
  phy->conf->crcinc = (!statlen && phy->mode == PHY_IEEE) ? RADIO_PCNF0_CRCINC_Include : RADIO_PCNF0_CRCINC_Exclude;
#endif
  /* For statlen our payload air ticks can be our actual length */
  if(!statlen) {
    if(phy->mode != PHY_IEEE) {
      osf_buf_phy->ble.s0 = 1;
      osf_buf_phy->ble.len = len;
#if OSF_PACKET_WITH_S1
      osf_buf_phy->ble.s1 = 1;
#endif
    } else {
#if defined(RADIO_PCNF0_CRCINC_Msk)
      phy->conf->crcinc = RADIO_PCNF0_CRCINC_Include;
#endif
      osf_buf_phy->ieee.len = len + phy->crclen;
    }
  }
  my_radio_set_phy_airtime(phy, len, statlen);
  /* Calculate total slot time */
  phy->packet_air_ticks = phy->header_air_ticks
                          + phy->post_addr_air_ticks
                          + phy->payload_air_ticks
                          + phy->footer_air_ticks;
  phy->slot_duration = phy->packet_air_ticks + OSF_TIFS_TICKS;
  /* Configure CRC */
  nrf_radio_packet_configure(phy->conf);
  nrf_radio_crc_configure(phy->crclen, phy->crcaddr, phy->crcpoly);
  nrf_radio_crcinit_set(phy->crcinit);
}

/*---------------------------------------------------------------------------*/
void
configure_address(osf_phy_conf_t *conf, uint8_t addr)
{
  /* In general it is bad practice to start an address with either 0x00, 0xFF,
     0xA or 0x5. 0x00 and 0xFF because they contain no bit shifts, and 0xA or
     0x5 because they form a continuation of the preamble (the preamble is
     either 0xAA or 0x55). */
  if (conf->mode != PHY_IEEE) {
    /* Radio address config */
    NRF_RADIO->PREFIX0 = ((uint32_t) swap_bits(0xC3) << 24) // Prefix byte of address 3 converted to nRF24L series format
        | ((uint32_t) swap_bits(0xC2) << 16) // Prefix byte of address 2 converted to nRF24L series format
        | ((uint32_t) swap_bits(0xC1) << 8)  // Prefix byte of address 1 converted to nRF24L series format
        | ((uint32_t) swap_bits(0xC0) << 0); // Prefix byte of address 0 converted to nRF24L series format

    NRF_RADIO->PREFIX1 = ((uint32_t) swap_bits(0xC7) << 24) // Prefix byte of address 7 converted to nRF24L series format
        | ((uint32_t) swap_bits(0xC6) << 16) // Prefix byte of address 6 converted to nRF24L series format
        | ((uint32_t) swap_bits(0xC4) << 0); // Prefix byte of address 4 converted to nRF24L series format
    NRF_RADIO->BASE0 = bytewise_bitswap(0x01234050UL); // Base address for prefix 0 converted to nRF24L series format
    NRF_RADIO->BASE1 = bytewise_bitswap(0x89ABCDEFUL); // Base address for prefix 1-7 converted to nRF24L series format
    /* Seed the address with a custom address byte.
       FIXME: I've tried just or-ing the last byte, but I guess the addresses
             aren't sufficiently different to prevent flipped bits from making
             us think we are on the correct round when actually we aren't. For now,
             let's just put some random addresses in. */
    if(addr == 0) {
      NRF_RADIO->BASE0 = bytewise_bitswap(0x01234050UL);
    } else if (addr == 1) {
      NRF_RADIO->BASE0 = bytewise_bitswap(0x02135060UL);
    } else {
      NRF_RADIO->BASE0 = bytewise_bitswap(0xBF943732UL);
    }
    /* Use logical address 0 (prefix0 + base0) = 0x8E89BED6 when transmitting and receiving */
    NRF_RADIO->TXADDRESS = 0x00UL;
    NRF_RADIO->RXADDRESSES = 0x01UL;
  /* IEEE */
  } else {
    // TODO: What do we actually do for IEEE?
    // NRF_RADIO->SFD = 0xA7UL; // default SFD for 802.15.4, no need to set it explicitly
#if NRF52840_WITH_IEEE_PHY
    NRF_RADIO->SFD = 0xAEUL; // custom SFD for 802.15.4
#endif
  }
}

/*---------------------------------------------------------------------------*/
osf_phy_conf_t *
my_radio_get_phy_conf(uint8_t mode)
{
  switch (mode) {
    case PHY_BLE_2M:
      return &osf_phy_conf_2M;
    case PHY_BLE_1M:
      return &osf_phy_conf_1M;
#if NRF52840_WITH_CODED_PHY
    case PHY_BLE_500K:
      return &osf_phy_conf_500K;
    case PHY_BLE_125K:
      return &osf_phy_conf_125K;
#endif
#if NRF52840_WITH_IEEE_PHY
    case PHY_IEEE:
      return &osf_phy_conf_802154;
#endif
    default:
      LOG_ERR("Unknown PHY configuration!\n");
      return NULL;
  }
}

/*---------------------------------------------------------------------------*/
rtimer_clock_t
my_radio_set_phy_airtime(osf_phy_conf_t *phy, uint8_t len, uint8_t statlen)
{
  /* NB: If we aren't using statlen we need to set maxlen. This is mainly for the
     slot duration calculations we make in the proto configure() for each round.
     if we don't set it here (even though we set in configure_phy() then the
     incorrect air time is calculated for non-statlen packets. */
  phy->conf->maxlen = (!statlen) ? OSF_MAXLEN(phy->mode) : len;
  /* For static length payloads just use the len */
  if(statlen) {
    if(phy->mode == PHY_BLE_125K) {
      phy->post_addr_air_ticks = OSF_PHY_BITS_TO_RTIMERTICKSX(5, PHY_BLE_125K); // 2bit CI + 3bit TERM1 @125K (16us + 24us).
    } else if (phy->mode == PHY_BLE_500K){
      // NB: WE SHOULDN'T need this but LA shows a missing 27.232us on 500K. FIXME: Only nordic knows why.
      phy->post_addr_air_ticks = OSF_PHY_BITS_TO_RTIMERTICKSX(5, PHY_BLE_125K) + US_TO_RTIMERTICKSX(27) + 3; // 2bit CI + 3bit TERM1 @125K (16us + 24us).
    } else {
      phy->post_addr_air_ticks = 0;
    }
    phy->payload_air_ticks = OSF_PHY_BYTES_TO_RTIMERTICKSX(len, phy->mode);
  /* For variable length payloads we need to assume a worst case (MTU) */
  } else {
    if(phy->mode == PHY_BLE_500K || phy->mode == PHY_BLE_125K) {
      /* Post-address */
      phy->post_addr_air_ticks = OSF_PHY_BITS_TO_RTIMERTICKSX(5, PHY_BLE_125K) // 2bit CI + 3bit TERM1 @125K (16us + 24us).
                                 + OSF_PHY_BYTES_TO_RTIMERTICKSX(1, phy->mode) // S0 @os/net/mac/osfk (optional).
                                 + OSF_PHY_BITS_TO_RTIMERTICKSX(8, phy->mode); // LF @125k (optional).
#if OSF_PACKET_WITH_S1
      phy->post_addr_air_ticks += OSF_PHY_BITS_TO_RTIMERTICKSX(1, phy->mode); // S1 @125k (optional).
#endif
      /* Payload */
      phy->payload_air_ticks = OSF_PHY_BYTES_TO_RTIMERTICKSX(phy->conf->maxlen, phy->mode);
    } else {
      phy->post_addr_air_ticks = OSF_PHY_BYTES_TO_RTIMERTICKSX(OSF_PKT_PHY_LEN(phy->mode, statlen), phy->mode); // S0, LF, and S1 @125k (optional)
      phy->payload_air_ticks = OSF_PHY_BYTES_TO_RTIMERTICKSX(phy->conf->maxlen, phy->mode);
    }
  }
  // NB: We SHOULDN'T need this, but the LA shows a missing...
  //     500K - 11.232us
  //     125K - 8.232us...
  //     IEEE - 4us exactly
  // FIXME: Only Nordic knows why...
  if(phy->mode == PHY_BLE_500K) {
    phy->post_addr_air_ticks += US_TO_RTIMERTICKSX(11) + 3;
  } else if (phy->mode == PHY_BLE_125K) {
    phy->post_addr_air_ticks += US_TO_RTIMERTICKSX(8) + 3;
  } else if (phy->mode == PHY_IEEE) {
    phy->post_addr_air_ticks += US_TO_RTIMERTICKSX(4);
  }
  /* Calculate total slot time */
  phy->packet_air_ticks = phy->header_air_ticks
                          + phy->post_addr_air_ticks
                          + phy->payload_air_ticks
                          + phy->footer_air_ticks;
  phy->slot_duration = phy->packet_air_ticks + OSF_TIFS_TICKS;

  return phy->slot_duration;
}

