open-sf/osf/os/net/mac/osf/nrf52840-osf.c
/*---------------------------------------------------------------------------*/
void
my_radio_init(osf_phy_conf_t *phy_conf, void *my_tx_buffer, uint8_t len, uint8_t statlen, uint8_t addr)
{
  UNUSED(print_radio_config);

  /* Disable and clear all interrupts */
  NVIC_DisableIRQ(RADIO_IRQn);
  nrf_radio_int_disable(0xFFFFFFFF);
  NVIC_ClearPendingIRQ(RADIO_IRQn);
  NVIC_SetPriority(RADIO_IRQn, 0);

  /* Reset all states in the radio peripheral */
  NRF_RADIO->POWER = 0UL;
  NRF_RADIO->POWER = 1UL;

#if RADIO_TXRX_PIN
  // TODO: Should move all debug stuff to debug
  NRF_GPIOTE->CONFIG[RADIO_TXRX_GPIOTE_CH] = (GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos) | (RADIO_TXRX_PIN << GPIOTE_CONFIG_PSEL_Pos);
#endif

  /* TX power */
  set_txpower(OSF_TXPOWER);
  NRF_RADIO->TXPOWER = nrf_tx_power;

  /* NB: Default ch for now, set to correct channel on TX/RX */
  NRF_RADIO->FREQUENCY = CH_DEFAULT;
#if OSF_PHY_WHITENING
  NRF_RADIO->DATAWHITEIV = CH_DEFAULT;
#endif

  /* Fast RU (40us) */
  NRF_RADIO->MODECNF0 = (RADIO_MODECNF0_RU_Fast << RADIO_MODECNF0_RU_Pos);
  /* Pull instructions from cache rather than flash */
  NRF_NVMC->ICACHECNF = NVMC_ICACHECNF_CACHEEN_Msk;
  /* Constant CPU wakeup latency. */
  NRF_POWER->TASKS_CONSTLAT = 1UL;

  /* Configure physical layer params */
  if(phy_conf != NULL) {
    osf_phy_conf = phy_conf;
    configure_phy(phy_conf, len, statlen);
    configure_errata(phy_conf);
    configure_address(phy_conf, addr);
  } else {
    osf_phy_conf = NULL;
  }

  /* Configure buffer */
  NRF_RADIO->PACKETPTR = (uint32_t)my_tx_buffer;

  /* Create a short between ready and start */
  NRF_RADIO->SHORTS |= RADIO_SHORTS_READY_START_Msk;
  /* RSSI shorts (takes 8us) - in case of 802.15.4, the PPI starts RSSISTART upon recieving a FRAMESTART event */
  NRF_RADIO->SHORTS |= RADIO_SHORTS_ADDRESS_RSSISTART_Msk;

  /* Configure PPI for RADIO EVENTS */
  // NRF_RADIO->INTENSET = RADIO_INTENSET_READY_Msk | RADIO_INTENSET_END_Msk;
  /* Ready Event */
  NRF_PPI->CH[RADIO_READY_CH].EEP = (uint32_t)&NRF_RADIO->EVENTS_READY;
  NRF_PPI->CH[RADIO_READY_CH].TEP = (uint32_t)&NRF_TIMERX->TASKS_CAPTURE[TIMESTAMP_REG];
  /* End Event */
  NRF_PPI->CH[RADIO_END_CH].EEP = (uint32_t)&NRF_RADIO->EVENTS_END;
  NRF_PPI->CH[RADIO_END_CH].TEP = (uint32_t)&NRF_TIMERX->TASKS_CAPTURE[TIMESTAMP_REG];
  /* Address Event */
  NRF_PPI->CH[RADIO_ADDRESS_CH].EEP = (uint32_t)&NRF_RADIO->EVENTS_ADDRESS;
  // NRF_RADIO->INTENSET |= RADIO_INTENSET_ADDRESS_Msk;
  // FIXME: FRAMESTART doesn't seem to work with IEEE. However ADDRESS works
  //        just fine. While this isn't an issue at the moment, if we want
  //        adhere to the standard (e.g., to listen for std packets) then this
  //        needs fixed.
  /* Address/Framestart Event */ //
  // if(phy_conf->mode == PHY_IEEE) {
  //   NRF_PPI->CH[RADIO_ADDRESS_CH].EEP = (uint32_t)&NRF_RADIO->EVENTS_FRAMESTART;
  //   NRF_RADIO->INTENSET |= RADIO_INTENSET_FRAMESTART_Msk;
  // } else {
  //   NRF_PPI->CH[RADIO_ADDRESS_CH].EEP = (uint32_t)&NRF_RADIO->EVENTS_ADDRESS;
  //   NRF_RADIO->INTENSET |= RADIO_INTENSET_ADDRESS_Msk;
  // }

  NRF_PPI->CH[RADIO_ADDRESS_CH].TEP = (uint32_t)&NRF_TIMERX->TASKS_CAPTURE[TIMESTAMP_REG];
  NRF_PPI->CHENSET = (1UL << RADIO_READY_CH) | (1UL << RADIO_ADDRESS_CH) | (1UL << RADIO_END_CH);

  /* Configure PPI for RADIO TX/RX */
  NRF_PPI->CH[RADIO_TXEN_CH].EEP = (uint32_t)&NRF_TIMERX->EVENTS_COMPARE[SCHEDULE_REG];
  NRF_PPI->CH[RADIO_TXEN_CH].TEP = (uint32_t)&NRF_RADIO->TASKS_TXEN;
  NRF_PPI->CH[RADIO_RXEN_CH].EEP = (uint32_t)&NRF_TIMERX->EVENTS_COMPARE[SCHEDULE_REG];
  NRF_PPI->CH[RADIO_RXEN_CH].TEP = (uint32_t)&NRF_RADIO->TASKS_RXEN;
  /* Reinit radio interrupts */
  // NVIC_EnableIRQ(RADIO_IRQn);
}
/*---------------------------------------------------------------------------*/
/* TX at t_abs */
uint8_t
schedule_tx_abs(uint8_t *buf, uint8_t channel, rtimer_clock_t t_abs)
{
  my_radio_off_to_tx();
  /* Check we can set the timer. We don't use rimterx_set() here as we are
     already interrupting on EVENTS_READY */
  uint8_t r;
  rtimer_clock_t now = rtimerx_now();
  /* ERR - Not enough time to schedule timer */
  if(RTIMER_CLOCK_LT(t_abs, now)) {
    LOG_DBG("{%u|ep-%-4u} rt miss TX %s slot:%u | d:+%lu us e_ref:+%lu us t_ref:+%lu us\n",
      node_id, osf.epoch, OSF_ROUND_TO_STR(osf.round->type), osf.slot, RTIMERTICKS_TO_USX(now - t_abs), RTIMERTICKS_TO_USX(now - osf.t_epoch_ref), RTIMERTICKS_TO_USX(now - t_ref));
    r = RTIMER_ERR_TIME;
    osf_stat.osf_rt_miss_tx_total++;/* Statistics */
  /* OK - Schedule RX*/
  } else {
    NRF_RADIO->TASKS_DISABLE = 1UL;
    NRF_TIMERX->EVENTS_COMPARE[SCHEDULE_REG] = 0UL;
    NRF_TIMERX->CC[SCHEDULE_REG] = t_abs;
    NRF_RADIO->FREQUENCY = channel;
  #if OSF_PHY_WHITENING
    NRF_RADIO->DATAWHITEIV = channel;
  #endif
    NRF_RADIO->PACKETPTR = (uint32_t)buf;
    r = RTIMER_OK;

    nrf_radio_int_enable(RADIO_INTENSET_READY_Msk | RADIO_INTENSET_END_Msk | RADIO_INTENSET_ADDRESS_Msk);
    NVIC_EnableIRQ(RADIO_IRQn);
  }

  return r;
}
/*---------------------------------------------------------------------------*/
void
my_radio_off_completely()
{
  /* Disable RADIO_IRQ */
  NVIC_DisableIRQ(RADIO_IRQn);
  nrf_radio_int_disable(0xFFFFFFFF);
  NVIC_ClearPendingIRQ(RADIO_IRQn);

  /* Disable scheduled TX/RX */
  NRF_PPI->CHENCLR = (1UL << RADIO_TXEN_CH);
  NRF_PPI->CHENCLR = (1UL << RADIO_RXEN_CH);

  NRF_TIMERX->EVENTS_COMPARE[SCHEDULE_REG] = 0UL;

  /* Clear event register */
  NRF_RADIO->EVENTS_DISABLED = 0UL;

  /* Clear TX/RXEN (just in case it's set) */
  NRF_RADIO->TASKS_RXEN = 0UL;
  NRF_RADIO->TASKS_TXEN = 0UL;

  /* Disable Radio */
  NRF_RADIO->TASKS_DISABLE = 1UL;
  NRF_RADIO->EVENTS_END = 0UL;
  NRF_RADIO->EVENTS_ADDRESS = 0UL;
  NRF_RADIO->EVENTS_PAYLOAD = 0UL;
  NRF_RADIO->EVENTS_READY = 0UL;
#if NRF52840_WITH_IEEE_PHY /* Check if those are really tied to*/
  NRF_RADIO->EVENTS_FRAMESTART = 0UL;
  NRF_RADIO->EVENTS_PHYEND = 0UL;
#endif
  NRF_RADIO->EVENTS_CRCOK = 0UL;
  NRF_RADIO->EVENTS_CRCERROR = 0UL;

#if OSF_DEBUG_GPIO
#if RADIO_TXEN_PIN
  NRF_PPI->CHENCLR = (1UL << RADIO_T0_TX_EVENT_PPI_CH); /* disable TXen debug pin PPI */
#endif
#if RADIO_RXEN_PIN
  NRF_PPI->CHENCLR = (1UL << RADIO_T0_RX_EVENT_PPI_CH); /* disable RXen debug pin PPI */
#endif
#if RADIO_TXRX_PIN
  NRF_GPIOTE->CONFIG[RADIO_TXRX_GPIOTE_CH] &= ~((RADIO_TXRX_PIN << GPIOTE_CONFIG_PSEL_Pos) | (GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos)); /* disable TXRXen debug PPI */
#endif
#endif /* OSF_DEBUG_GPIO */

  NRF_RADIO->EVENTS_DISABLED = 0UL;
  NRF_RADIO->POWER = 0UL;
}
/*---------------------------------------------------------------------------*/
void
my_radio_off_to_tx()
{
  /* Disable and clear all interrupts */
  NVIC_DisableIRQ(RADIO_IRQn);
  nrf_radio_int_disable(0xFFFFFFFF);
  NVIC_ClearPendingIRQ(RADIO_IRQn);

  /* Enable scheduled TX : TimerX-compare[0] -> TxEn */
  NRF_PPI->CHENSET = (1UL << RADIO_TXEN_CH);
  /* Disable RX scheduling shortcut */
  NRF_PPI->CHENCLR = (1UL << RADIO_RXEN_CH);

#if OSF_DEBUG_GPIO
#if RADIO_TXEN_PIN
/* Enable TXen debug pin PPI --> Timer 0 compare event toggles TXen debug pin */
  NRF_PPI->CHENSET = (1UL << RADIO_T0_TX_EVENT_PPI_CH);
#endif
#if RADIO_RXEN_PIN
  /* Disable RXen debug pin PPI */
  NRF_PPI->CHENCLR = (1UL << RADIO_T0_RX_EVENT_PPI_CH);
#endif
#endif /* OSF_DEBUG_GPIO */

  NRF_TIMERX->EVENTS_COMPARE[SCHEDULE_REG] = 0UL;

  /* Clear event register */
  NRF_RADIO->EVENTS_DISABLED = 0UL;

  /* Disable radio */
  NRF_RADIO->TASKS_DISABLE = 1UL;

  NRF_RADIO->EVENTS_END = 0UL;
  NRF_RADIO->EVENTS_ADDRESS = 0UL;
  NRF_RADIO->EVENTS_READY = 0UL;
#if NRF52840_WITH_IEEE_PHY /* Check if those are really tied to*/
  NRF_RADIO->EVENTS_FRAMESTART = 0UL;
  NRF_RADIO->EVENTS_PHYEND = 0UL;
#endif
  NRF_RADIO->EVENTS_CRCOK = 0UL;
  NRF_RADIO->EVENTS_CRCERROR = 0UL;

  NRF_RADIO->TXPOWER = nrf_tx_power;

  NRF_RADIO->EVENTS_DISABLED = 0UL;
}
/*---------------------------------------------------------------------------*/
/* RX at t_abs */
uint8_t
schedule_rx_abs(uint8_t *buf, uint8_t channel, rtimer_clock_t t_abs)
{
  my_radio_off_to_rx();
  /* Check we can set the timer. We don't use rimterx_set() here as we are
     already interrupting on EVENTS_READY */
  uint8_t r;
  rtimer_clock_t now = rtimerx_now();
  /* ERR - Not enough time to schedule timer */
  if(RTIMER_CLOCK_LT(t_abs, now)) {
    LOG_DBG("{%u|ep-%-4u} rt miss RX %s slot:%u offset: %lu | d:+%luus e_ref:+%luus t_ref:+%luus off:%luus ref_shft:%luus\n",
      node_id, osf.epoch, OSF_ROUND_TO_STR(osf.round->type), osf.slot, RTIMERTICKS_TO_USX(osf.rconf->t_offset), RTIMERTICKS_TO_USX(now - t_abs), RTIMERTICKS_TO_USX(now - osf.t_epoch_ref), RTIMERTICKS_TO_USX(t_ref - now), RTIMERTICKS_TO_USX(t_ref - osf.t_epoch_ref), RTIMERTICKS_TO_USX(OSF_REF_SHIFT));
    r = RTIMER_ERR_TIME;
    osf_stat.osf_rt_miss_rx_total++;/* Statistics */
  /* OK - Schedule RX*/
  } else {
    NRF_TIMERX->EVENTS_COMPARE[SCHEDULE_REG] = 0UL;
    NRF_TIMERX->CC[SCHEDULE_REG] = t_abs;
    NRF_RADIO->FREQUENCY = channel;
#if OSF_PHY_WHITENING
    NRF_RADIO->DATAWHITEIV = channel;
#endif
    NRF_RADIO->PACKETPTR = (uint32_t)buf;
    r = RTIMER_OK;

    nrf_radio_int_enable(RADIO_INTENSET_READY_Msk | RADIO_INTENSET_END_Msk | RADIO_INTENSET_ADDRESS_Msk);
    NVIC_EnableIRQ(RADIO_IRQn);
  }

  return r;
}

