open-sf/osf/os/net/mac/osf/nrf52840-osf.c
/*---------------------------------------------------------------------------*/
void
my_radio_rx_hop_channel(uint8_t channel)
{
  NRF_RADIO->TASKS_DISABLE = 1UL;
  NRF_RADIO->FREQUENCY = channel;
#if OSF_PHY_WHITENING
  NRF_RADIO->DATAWHITEIV = channel;
#endif
  NRF_RADIO->TASKS_RXEN = 1UL;
}

/*---------------------------------------------------------------------------*/
void
my_radio_off_to_rx()
{
  /* Disable and clear all interrupts */
  NVIC_DisableIRQ(RADIO_IRQn);
  nrf_radio_int_disable(0xFFFFFFFF);
  NVIC_ClearPendingIRQ(RADIO_IRQn);

  /* Enable scheduled RX */
  NRF_PPI->CHENSET = (1UL << RADIO_RXEN_CH);
  /* Disable TX scheduling shortcut */
  NRF_PPI->CHENCLR = (1UL << RADIO_TXEN_CH);

  NRF_TIMERX->EVENTS_COMPARE[SCHEDULE_REG] = 0UL;

  /* Clear event register */
  NRF_RADIO->EVENTS_DISABLED = 0UL;

  /* Disable radio */
  NRF_RADIO->TASKS_DISABLE = 1UL;
  NRF_RADIO->EVENTS_END = 0UL;
  NRF_RADIO->EVENTS_ADDRESS = 0UL;
  NRF_RADIO->EVENTS_PAYLOAD = 0UL;
  NRF_RADIO->EVENTS_READY = 0UL;
#if NRF52840_WITH_IEEE_PHY /* Check if those are really tied to*/
  NRF_RADIO->EVENTS_FRAMESTART = 0UL;
  NRF_RADIO->EVENTS_PHYEND = 0UL;
#endif

#if OSF_DEBUG_GPIO
#if RADIO_TXEN_PIN
  /* Enable RXen debug pin PPI */
  NRF_PPI->CHENSET = (1UL << RADIO_T0_RX_EVENT_PPI_CH);
#endif
#if RADIO_RXEN_PIN
  /* Disable TXen debug pin PPI */
  NRF_PPI->CHENCLR = (1UL << RADIO_T0_TX_EVENT_PPI_CH);
#endif
#endif /* OSF_DEBUG_GPIO */

  NRF_RADIO->EVENTS_DISABLED = 0UL;
}

/*---------------------------------------------------------------------------*/
void
my_radio_set_maxlen(uint8_t maxlen)
{
  NRF_RADIO->PCNF1 = (NRF_RADIO->PCNF1 & ~(RADIO_PCNF1_MAXLEN_Msk)) | \
    ((maxlen) << (RADIO_PCNF1_MAXLEN_Pos));
}

/*---------------------------------------------------------------------------*/
static void
print_radio_config()
{
  /* Print configuration info and timing constants for verification */
  uint32_t mcuvar = NRF_FICR->INFO.VARIANT;
  uint8_t var[4] = { 0, 0, 0, 0 };
  memcpy(var, &mcuvar, sizeof(uint32_t));
  LOG_DBG("OSF Radio config... (DEBUG)\n");
  LOG_DBG("MCU                        : nRF%lX, MCU.VARIANT : %c%c%c%c\n", NRF_FICR->INFO.PART, var[3], var[2], var[1], var[0]);
  LOG_DBG("MCU.PACKAGE                : 0x%lX\n", NRF_FICR->INFO.PACKAGE);
  LOG_DBG("MCU.RAM : 0x%lX, MCU.FLASH : 0x%lX\n", NRF_FICR->INFO.RAM, NRF_FICR->INFO.FLASH);

#if (defined(NRF52840_XXAA) || defined(NRF52833_XXAA))
  LOG_DBG("NRF_POWER->MAINREGSTATUS   : 0x%08lX\n", NRF_POWER->MAINREGSTATUS);
#endif

  LOG_DBG("NRF_POWER->RESETREAS       : 0x%08lX\n", NRF_POWER->RESETREAS);
  if(NRF_POWER->RESETREAS & 0x00000001) {
    LOG_WARN("- Reset from pin-reset detected !\n");
  }
  if(NRF_POWER->RESETREAS & 0x00000002) {
    LOG_ERR("- Reset from watchdog detected !\n");
  }
  if(NRF_POWER->RESETREAS & 0x00000004) {
    LOG_ERR("- Reset from soft reset detected !\n");
  }
  if(NRF_POWER->RESETREAS & 0x00000008) {
    LOG_ERR("- Reset from CPU lock-up detected !\n");
  }
  NRF_POWER->RESETREAS = 0xFFFFFFFF;
  LOG_DBG("NRF_POWER->POFCON       : 0x%08lX\n", NRF_POWER->POFCON);

#if (defined(NRF52840_XXAA) || defined(NRF52833_XXAA))
  LOG_DBG("NRF_POWER->USBREGSTATUS : 0x%08lX\n", NRF_POWER->USBREGSTATUS);
#endif

  LOG_DBG("NRF_CLOCK->LFCLKSRC     : 0x%08lX\n", NRF_CLOCK->LFCLKSRC);
  LOG_DBG("NRF_CLOCK->LFCLKSTAT    : 0x%08lX\n", NRF_CLOCK->LFCLKSTAT);
  LOG_DBG("NRF_CLOCK->HFCLKSTAT    : 0x%08lX\n", NRF_CLOCK->HFCLKSTAT);

#ifdef NRF52840_XXAA
  LOG_DBG("NRF_CLOCK->LFRCMODE     : 0x%08lX\n", NRF_CLOCK->LFRCMODE);  // nrf52833 Port: commented out to avoid compile error, not needed
#endif

  LOG_DBG("NRF_WDT->RUNSTATUS      : 0x%08lX\n", NRF_WDT->RUNSTATUS);
  LOG_DBG("NRF_WDT->CRV            : 0x%08lX\n", NRF_WDT->CRV);
  LOG_DBG("NRF_WDT->CONFIG         : 0x%08lX\n", NRF_WDT->CONFIG);
  LOG_DBG("NRF_WDT->RREN           : 0x%08lX\n", NRF_WDT->RREN);

  LOG_DBG("NRF_RADIO->MODE         : 0x%08lX\n", NRF_RADIO->MODE);
  LOG_DBG("NRF_RADIO->MODECNF0     : 0x%08lX\n", NRF_RADIO->MODECNF0);
  LOG_DBG("NRF_RADIO->SHORTS       : 0x%08lX\n", NRF_RADIO->SHORTS);
  LOG_DBG("NRF_RADIO->TXPOWER      : 0x%08lX\n", NRF_RADIO->TXPOWER);

  LOG_DBG("NRF_RADIO->PCNF0        : 0x%08lX\n", NRF_RADIO->PCNF0);
  LOG_DBG("NRF_RADIO->PCNF1        : 0x%08lX\n", NRF_RADIO->PCNF1);

  LOG_DBG("NRF_RADIO->CRCCNF       : 0x%08lX\n", NRF_RADIO->CRCCNF);
  LOG_DBG("NRF_RADIO->CRCPOLY      : 0x%08lX\n", NRF_RADIO->CRCPOLY);
  LOG_DBG("NRF_RADIO->CRCINIT      : 0x%08lX\n", NRF_RADIO->CRCINIT);

  LOG_DBG("NRF_RADIO->BASE0        : 0x%08lX\n", NRF_RADIO->BASE0);
  LOG_DBG("NRF_RADIO->PREFIX0      : 0x%08lX\n", NRF_RADIO->PREFIX0);
  LOG_DBG("NRF_RADIO->BASE1        : 0x%08lX\n", NRF_RADIO->BASE1);
  LOG_DBG("NRF_RADIO->PREFIX1      : 0x%08lX\n", NRF_RADIO->PREFIX1);
  LOG_DBG("NRF_RADIO->BASE0        : 0x%08lX\n", NRF_RADIO->BASE0);
  LOG_DBG("NRF_RADIO->TXADDRESS    : 0x%08lX\n", NRF_RADIO->TXADDRESS);
  LOG_DBG("NRF_RADIO->RXADDRESSES  : 0x%08lX\n", NRF_RADIO->RXADDRESSES);
#if NRF52840_WITH_IEEE_PHY
  LOG_DBG("NRF_RADIO->SFD          : 0x%08lX\n", NRF_RADIO->SFD);
#endif
  LOG_DBG("NRF_RADIO->TIFS         : 0x%08lX\n", NRF_RADIO->TIFS);
  LOG_DBG("NRF_RADIO->INTENSET     : 0x%08lX\n", NRF_RADIO->INTENSET);

  LOG_DBG("PPI config              : 0x%08lX\n", NRF_PPI->CHEN);

  /* Errata registers. */
  LOG_DBG("0x4000173C              : 0x%08lX\n", *(volatile uint32_t *)0x4000173C);
  LOG_DBG("0x40001740              : 0x%08lX\n", *(volatile uint32_t *)0x40001740);
}
